app/controllers/admin/users_controller.rb

SELECT  "users".* FROM "users"  ORDER BY firstname LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "users"
---
  def index
    @users = User.order("firstname").page(params[:page]).per(5)